medic mobile listing.xml

<?xml version="1.0" encoding="UTF-8"?>
 <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
   <notifications xmlns="http://soap.sforce.com/2005/09/outbound">
    <OrganizationId>00Dw0000000nd7VEAQ</OrganizationId>
    <ActionId>04kw0000000CdezAAC</ActionId>
    <SessionId xsi:nil="true"/>
    <EnterpriseUrl>https://eu3.salesforce.com/services/Soap/c/32.0/00Dw0000000nd7V</EnterpriseUrl>
    <PartnerUrl>https://eu3.salesforce.com/services/Soap/u/32.0/00Dw0000000nd7V</PartnerUrl>
    <Notification>
     <Id>04lw000000MusE8AAJ</Id>
     <sObject xsi:type="sf:Listing__c" xmlns:sf="urn:sobject.enterprise.soap.sforce.com">
      <sf:Id>a00w000000VdkreAAB</sf:Id>
      <sf:Description__c>Mobile &amp; web tools that help health workers reach everyone. Health workers use Medic Mobile to register every pregnancy, track disease outbreaks faster, keep stock of essential medicines and communicate about emergencies. Our platform is built for the last mile of healthcare. We are committed to free, open-source platforms that can be adapted for specific uses backed by evidence.</sf:Description__c>
      <sf:Name>Medic Mobile</sf:Name>
      <sf:Tags__c>Android;Browser Based;Open Source;Integrated;API;Hosted</sf:Tags__c>
      <sf:Website__c>www.medicmobile.org</sf:Website__c>
     </sObject>
    </Notification>
   </notifications>
  </soapenv:Body>
 </soapenv:Envelope>